In [1]:
import pandas as pd
import numpy as np

# pandas series

In [2]:
list1=[1,2,3,4]
pd.Series(list1)

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
pd.Series(list1,['a','b','c','d'])

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
pd.Series(np.array([1,2]),[1,2])

1    1
2    2
dtype: int32

In [5]:
pd.Series(np.array(['a',22,print]))

0                            a
1                           22
2    <built-in function print>
dtype: object

# accessing elements

In [6]:
ser1=pd.Series(['a','b','c'])
ser1

0    a
1    b
2    c
dtype: object

In [7]:
ser1[1]

'b'

In [8]:
ser1[1:4]

1    b
2    c
dtype: object

In [9]:
ser1.values

array(['a', 'b', 'c'], dtype=object)

In [10]:
sr2=pd.Series([1,2,3,4],['a','b','d','c'])

In [11]:
sr2

a    1
b    2
d    3
c    4
dtype: int64

In [12]:
sr2["b"]

2

In [13]:
sr2['b':'c']

b    2
d    3
c    4
dtype: int64

In [14]:
sr2.values

array([1, 2, 3, 4], dtype=int64)

In [15]:
sr2.index

Index(['a', 'b', 'd', 'c'], dtype='object')

In [16]:
#drop something
sr2.drop('d')

a    1
b    2
c    4
dtype: int64

In [17]:
sr2

a    1
b    2
d    3
c    4
dtype: int64

In [18]:
sr2.drop('d',inplace=True)

In [19]:
sr2

a    1
b    2
c    4
dtype: int64

In [20]:
sr2['d']=5
sr2

a    1
b    2
c    4
d    5
dtype: int64

# Data frames

In [21]:
#collection of series object

In [22]:
data=np.random.rand(5,3)
data

array([[0.140079  , 0.72575423, 0.6076584 ],
       [0.8564609 , 0.60070173, 0.88510727],
       [0.82558583, 0.56604782, 0.14389406],
       [0.63377571, 0.70344958, 0.9341922 ],
       [0.11692564, 0.54212501, 0.95888625]])

In [23]:
df=pd.DataFrame(data)

In [24]:
df

          0         1         2
0  0.140079  0.725754  0.607658
1  0.856461  0.600702  0.885107
2  0.825586  0.566048  0.143894
3  0.633776  0.703450  0.934192
4  0.116926  0.542125  0.958886

In [25]:
type(df[0])

pandas.core.series.Series

In [26]:
df2=pd.DataFrame(data,index=['a','b','c','d','e'],columns=["col1","col2","col3"])
df2

       col1      col2      col3
a  0.140079  0.725754  0.607658
b  0.856461  0.600702  0.885107
c  0.825586  0.566048  0.143894
d  0.633776  0.703450  0.934192
e  0.116926  0.542125  0.958886

In [27]:
df2.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [28]:
#using dictionaries
df_new=pd.DataFrame({"col1":[1,2,3],"col2":[4,5,6]})
df_new

   col1  col2
0     1     4
1     2     5
2     3     6

# accessing and selection

In [29]:
df2.col1   #risky

a    0.140079
b    0.856461
c    0.825586
d    0.633776
e    0.116926
Name: col1, dtype: float64

In [30]:
df2["col1"]

a    0.140079
b    0.856461
c    0.825586
d    0.633776
e    0.116926
Name: col1, dtype: float64

In [31]:
#loc[]
df2.loc["d"]  #row

col1    0.633776
col2    0.703450
col3    0.934192
Name: d, dtype: float64

In [32]:
type(df2.loc["d"])

pandas.core.series.Series

In [33]:
#multiple rows
df2.loc[['a','d']]

       col1      col2      col3
a  0.140079  0.725754  0.607658
d  0.633776  0.703450  0.934192

In [34]:
#select row and column
df2.loc["a","col1"]

0.14007900216008373

In [35]:
df2.loc[["a","d"],["col1","col2"]]

       col1      col2
a  0.140079  0.725754
d  0.633776  0.703450

In [36]:
#iloc[]
df2.iloc[0]

col1    0.140079
col2    0.725754
col3    0.607658
Name: a, dtype: float64

In [37]:
df2.iloc[0,2]

0.6076584030053283

In [38]:
df2.iloc[[0,1,3],[1]]

       col2
a  0.725754
b  0.600702
d  0.703450

In [39]:
df2

       col1      col2      col3
a  0.140079  0.725754  0.607658
b  0.856461  0.600702  0.885107
c  0.825586  0.566048  0.143894
d  0.633776  0.703450  0.934192
e  0.116926  0.542125  0.958886

In [40]:
#conditions
df2>0.6

    col1   col2   col3
a  False   True   True
b   True   True   True
c   True  False  False
d   True   True   True
e  False  False   True

In [41]:
df2[df2>0.6]

       col1      col2      col3
a       NaN  0.725754  0.607658
b  0.856461  0.600702  0.885107
c  0.825586       NaN       NaN
d  0.633776  0.703450  0.934192
e       NaN       NaN  0.958886

In [42]:
df2[df2["col3"]>0.6]

       col1      col2      col3
a  0.140079  0.725754  0.607658
b  0.856461  0.600702  0.885107
d  0.633776  0.703450  0.934192
e  0.116926  0.542125  0.958886

In [43]:
df2[(df2["col3"]>0.6) & (df2["col1"]>0.4)]

       col1      col2      col3
b  0.856461  0.600702  0.885107
d  0.633776  0.703450  0.934192

In [44]:
df2[df2["col3"]>0.6]["col1"]

a    0.140079
b    0.856461
d    0.633776
e    0.116926
Name: col1, dtype: float64

In [45]:
df3=df2.sort_index().reset_index(drop=True)

In [46]:
df3

       col1      col2      col3
0  0.140079  0.725754  0.607658
1  0.856461  0.600702  0.885107
2  0.825586  0.566048  0.143894
3  0.633776  0.703450  0.934192
4  0.116926  0.542125  0.958886

In [49]:
ds=pd.DataFrame(np.random.rand(15).reshape(5,3),columns=["col1","col2","col3"],index=["a","b","c","d","e"])
ds["col4"]=np.arange(5)

In [50]:
ds  #created new column

       col1      col2      col3  col4
a  0.579993  0.112921  0.698651     0
b  0.540300  0.359613  0.716732     1
c  0.789475  0.623524  0.517138     2
d  0.188343  0.198780  0.092354     3
e  0.919995  0.922473  0.478520     4

In [51]:
ds["col5"]=ds["col1"]+ds["col3"]

In [52]:
ds

       col1      col2      col3  col4      col5
a  0.579993  0.112921  0.698651     0  1.278644
b  0.540300  0.359613  0.716732     1  1.257032
c  0.789475  0.623524  0.517138     2  1.306613
d  0.188343  0.198780  0.092354     3  0.280697
e  0.919995  0.922473  0.478520     4  1.398515

In [56]:
#remove column 5
ds.drop(["col5"],axis=1)

       col1      col2      col3  col4
a  0.579993  0.112921  0.698651     0
b  0.540300  0.359613  0.716732     1
c  0.789475  0.623524  0.517138     2
d  0.188343  0.198780  0.092354     3
e  0.919995  0.922473  0.478520     4

In [58]:
ds

       col1      col2      col3  col4      col5
a  0.579993  0.112921  0.698651     0  1.278644
b  0.540300  0.359613  0.716732     1  1.257032
c  0.789475  0.623524  0.517138     2  1.306613
d  0.188343  0.198780  0.092354     3  0.280697
e  0.919995  0.922473  0.478520     4  1.398515

In [59]:
#so,
ds.drop("col5",axis=1,inplace=True)

In [60]:
ds

       col1      col2      col3  col4
a  0.579993  0.112921  0.698651     0
b  0.540300  0.359613  0.716732     1
c  0.789475  0.623524  0.517138     2
d  0.188343  0.198780  0.092354     3
e  0.919995  0.922473  0.478520     4

In [62]:
ds.drop("d")   #axis=0 by default so,no need to mention while dropping a row

       col1      col2      col3  col4
a  0.579993  0.112921  0.698651     0
b  0.540300  0.359613  0.716732     1
c  0.789475  0.623524  0.517138     2
e  0.919995  0.922473  0.478520     4

In [63]:
#drop rows based on conditions
ds.drop(ds[ds["col4"]>3].index)

       col1      col2      col3  col4
a  0.579993  0.112921  0.698651     0
b  0.540300  0.359613  0.716732     1
c  0.789475  0.623524  0.517138     2
d  0.188343  0.198780  0.092354     3

In [65]:
ds.drop(ds[(ds["col4"]>3) | (ds["col1"]<0.5)].index)

       col1      col2      col3  col4
a  0.579993  0.112921  0.698651     0
b  0.540300  0.359613  0.716732     1
c  0.789475  0.623524  0.517138     2

In [69]:
ds["col1"].sum()

3.0181072082260534

In [72]:
ds["col1"].apply('sum')

3.0181072082260534

In [73]:
ds["col1"].nunique()

5

# Multi-indexing

In [66]:
outer=["task1","task1","task2","task2"]
inner=["ram","lucky","ram","lucky"]
multiIndex=pd.MultiIndex.from_tuples(list(zip(outer,inner)))
multiIndex

MultiIndex([('task1',   'ram'),
            ('task1', 'lucky'),
            ('task2',   'ram'),
            ('task2', 'lucky')],
           )

In [67]:
df4=pd.DataFrame(np.random.rand(4,2),index=multiIndex,columns=["level1","level2"])

In [68]:
df4

               level1    level2
task1 ram    0.843128  0.437911
      lucky  0.961519  0.593772
task2 ram    0.191275  0.026849
      lucky  0.102958  0.579829

In [74]:
df4.loc[["task1","task2"],"level2"]

task1  ram      0.437911
       lucky    0.593772
task2  ram      0.026849
       lucky    0.579829
Name: level2, dtype: float64

In [75]:
df4.loc[("task1","ram")]

level1    0.843128
level2    0.437911
Name: (task1, ram), dtype: float64

In [76]:
df4.loc[("task1","ram"),"level1"]

0.8431282014203769

In [77]:
df4.loc[[("task1","ram"),("task2","lucky")],"level2"]

task1  ram      0.437911
task2  lucky    0.579829
Name: level2, dtype: float64